Sail2D/Runs/first_flatplate_150_10/case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10000;

deltaT          1;

writeControl    timeStep;

writeInterval   1000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


libs
(
    "libOpenFOAM.so"
    "libforces.so"
);

functions
{
    wings
    {
        patches             (wings);
		CofR 		    (0 0 0); //Origin for moment calculations
        outputControl timeStep;
        outputInterval 5;
        type forces;
        functionObjectLibs ("libforces.so");
        pName p;
        UName U;
        rhoName rhoInf;
        rhoInf 1.18;
        log true;
    }
}

// ************************************************************************* //
